---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryDemandFactorParam
source: html/b817ef84-94c1-70ea-21d7-b8299d3ab9f7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryDemandFactorParam Property

"Demand Factor"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecLoadsummaryDemandFactorParam { get; }
```